---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateLogical(Autodesk.Revit.DB.IFC.IFCLogical)
source: html/cd68d6e1-ac11-4d78-232f-c145db544722.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateLogical Method

Creates a logical data object.

## Syntax (C#)
```csharp
public static IFCData CreateLogical(
	IFCLogical value
)
```

## Parameters
- **value** (`Autodesk.Revit.DB.IFC.IFCLogical`) - The IFCLogical value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration